w3ichen/haptic-hand/stm32f4xx_adc_mort.c
  tmp = (uint32_t)ADCx;
  tmp += ADC_InjectedChannel + JDR_OFFSET;
  
  /* Returns the selected injected channel conversion data value */
  return (uint16_t) (*(__IO uint32_t*)  tmp); 
}
/**
  * @}
  */

/** @defgroup ADC_Group7 Interrupts and flags management functions
 *  @brief   Interrupts and flags management functions
 *
@verbatim   
 ===============================================================================
            ##### Interrupts and flags management functions #####
 ===============================================================================  

    [..] This section provides functions allowing to configure the ADC Interrupts 
         and to get the status and clear flags and Interrupts pending bits.
  
    [..] Each ADC provides 4 Interrupts sources and 6 Flags which can be divided
        into 3 groups:
  
  *** Flags and Interrupts for ADC regular channels ***
  =====================================================
    [..]
      (+) Flags :
        (##) ADC_FLAG_OVR_MORT : Overrun detection when regular converted data are lost

        (##) ADC_FLAG_EOC_MORT : Regular channel end of conversion ==> to indicate 
             (depending on EOCS bit, managed by ADC_EOCOnEachRegularChannelCmd() )
             the end of:
             (+++) a regular CHANNEL conversion 
             (+++) sequence of regular GROUP conversions .

        (##) ADC_FLAG_STRT_MORT: Regular channel start ==> to indicate when regular 
             CHANNEL conversion starts.
    [..]
      (+) Interrupts :
        (##) ADC_IT_OVR_MORT : specifies the interrupt source for Overrun detection 
             event.  
        (##) ADC_IT_EOC_MORT : specifies the interrupt source for Regular channel end
             of conversion event.
  
  
  *** Flags and Interrupts for ADC Injected channels ***
  ======================================================
    [..]
      (+) Flags :
        (##) ADC_FLAG_JEOC_MORT : Injected channel end of conversion ==> to indicate 
             at the end of injected GROUP conversion  
              
        (##) ADC_FLAG_JSTRT_MORT: Injected channel start ==> to indicate hardware when 
             injected GROUP conversion starts.
    [..]
      (+) Interrupts :
        (##) ADC_IT_JEOC_MORT : specifies the interrupt source for Injected channel 
             end of conversion event.     

  *** General Flags and Interrupts for the ADC ***
  ================================================ 
    [..]
      (+)Flags :
        (##) ADC_FLAG_AWD_MORT: Analog watchdog ==> to indicate if the converted voltage 
             crosses the programmed thresholds values.
    [..]          
      (+) Interrupts :
        (##) ADC_IT_AWD_MORT : specifies the interrupt source for Analog watchdog event. 

  
    [..] The user should identify which mode will be used in his application to 
         manage the ADC controller events: Polling mode or Interrupt mode.
  
    [..] In the Polling Mode it is advised to use the following functions:
      (+) ADC_GetFlagStatus() : to check if flags events occur. 
      (+) ADC_ClearFlag()     : to clear the flags events.
      
    [..] In the Interrupt Mode it is advised to use the following functions:
      (+) ADC_ITConfig()          : to enable or disable the interrupt source.
      (+) ADC_GetITStatus()       : to check if Interrupt occurs.
      (+) ADC_ClearITPendingBit() : to clear the Interrupt pending Bit 
                                   (corresponding Flag). 
@endverbatim
  * @{
  */ 
/**
  * @brief  Enables or disables the specified ADC interrupts.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_IT: specifies the ADC interrupt sources to be enabled or disabled. 
  *          This parameter can be one of the following values:
  *            @arg ADC_IT_EOC_MORT: End of conversion interrupt mask
  *            @arg ADC_IT_AWD_MORT: Analog watchdog interrupt mask
  *            @arg ADC_IT_JEOC_MORT: End of injected conversion interrupt mask
  *            @arg ADC_IT_OVR_MORT: Overrun interrupt enable                       
  * @param  NewState: new state of the specified ADC interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC_ITConfig_mort(ADC_TypeDef_mort* ADCx, uint16_t ADC_IT, FunctionalState NewState)  
{
  uint32_t itmask = 0;
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  assert_param(IS_ADC_IT(ADC_IT)); 

  /* Get the ADC IT index */
  itmask = (uint8_t)ADC_IT;
  itmask = (uint32_t)0x01 << itmask;    

  if (NewState != DISABLE)
  {
    /* Enable the selected ADC interrupts */
    ADCx->CR1 |= itmask;
  }
  else
  {
    /* Disable the selected ADC interrupts */
    ADCx->CR1 &= (~(uint32_t)itmask);
  }
}

/**
  * @brief  Checks whether the specified ADC flag is set or not.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_FLAG: specifies the flag to check. 
  *          This parameter can be one of the following values:
  *            @arg ADC_FLAG_AWD_MORT: Analog watchdog flag
  *            @arg ADC_FLAG_EOC_MORT: End of conversion flag
  *            @arg ADC_FLAG_JEOC_MORT: End of injected group conversion flag
  *            @arg ADC_FLAG_JSTRT_MORT: Start of injected group conversion flag
  *            @arg ADC_FLAG_STRT_MORT: Start of regular group conversion flag
  *            @arg ADC_FLAG_OVR_MORT: Overrun flag                                                 
  * @retval The new state of ADC_FLAG (SET or RESET).
  */
FlagStatus ADC_GetFlagStatus_mort(ADC_TypeDef_mort* ADCx, uint8_t ADC_FLAG)
{
  FlagStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_ADC_GET_FLAG(ADC_FLAG));

  /* Check the status of the specified ADC flag */
  if ((ADCx->SR & ADC_FLAG) != (uint8_t)RESET)
  {
    /* ADC_FLAG is set */
    bitstatus = SET;
  }
  else
  {
    /* ADC_FLAG is reset */
    bitstatus = RESET;
  }
  /* Return the ADC_FLAG status */
  return  bitstatus;
}

/**
  * @brief  Clears the ADCx's pending flags.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_FLAG: specifies the flag to clear. 
  *          This parameter can be any combination of the following values:
  *            @arg ADC_FLAG_AWD_MORT: Analog watchdog flag
  *            @arg ADC_FLAG_EOC_MORT: End of conversion flag
  *            @arg ADC_FLAG_JEOC_MORT: End of injected group conversion flag
  *            @arg ADC_FLAG_JSTRT_MORT: Start of injected group conversion flag
  *            @arg ADC_FLAG_STRT_MORT: Start of regular group conversion flag
  *            @arg ADC_FLAG_OVR_MORT: Overrun flag                          
  * @retval None
  */
void ADC_ClearFlag_mort(ADC_TypeDef_mort* ADCx, uint8_t ADC_FLAG)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_ADC_CLEAR_FLAG(ADC_FLAG));

  /* Clear the selected ADC flags */
  ADCx->SR = ~(uint32_t)ADC_FLAG;
}

/**
  * @brief  Checks whether the specified ADC interrupt has occurred or not.
  * @param  ADCx:   where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_IT: specifies the ADC interrupt source to check. 
  *          This parameter can be one of the following values:
  *            @arg ADC_IT_EOC_MORT: End of conversion interrupt mask
  *            @arg ADC_IT_AWD_MORT: Analog watchdog interrupt mask
  *            @arg ADC_IT_JEOC_MORT: End of injected conversion interrupt mask
  *            @arg ADC_IT_OVR_MORT: Overrun interrupt mask                        
  * @retval The new state of ADC_IT (SET or RESET).
  */
ITStatus ADC_GetITStatus_mort(ADC_TypeDef_mort* ADCx, uint16_t ADC_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t itmask = 0, enablestatus = 0;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_ADC_IT(ADC_IT));

  /* Get the ADC IT index */
  itmask = ADC_IT >> 8;

  /* Get the ADC_IT enable bit status */
  enablestatus = (ADCx->CR1 & ((uint32_t)0x01 << (uint8_t)ADC_IT)) ;

  /* Check the status of the specified ADC interrupt */
  if (((ADCx->SR & itmask) != (uint32_t)RESET) && enablestatus)
  {
    /* ADC_IT is set */
    bitstatus = SET;
  }
  else
  {
    /* ADC_IT is reset */
    bitstatus = RESET;
  }
  /* Return the ADC_IT status */
  return  bitstatus;
}

/**
  * @brief  Clears the ADCx's interrupt pending bits.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_IT: specifies the ADC interrupt pending bit to clear.
  *          This parameter can be one of the following values:
  *            @arg ADC_IT_EOC_MORT: End of conversion interrupt mask
  *            @arg ADC_IT_AWD_MORT: Analog watchdog interrupt mask
  *            @arg ADC_IT_JEOC_MORT: End of injected conversion interrupt mask
  *            @arg ADC_IT_OVR_MORT: Overrun interrupt mask                         
  * @retval None
  */
void ADC_ClearITPendingBit_mort(ADC_TypeDef_mort* ADCx, uint16_t ADC_IT)
{
  uint8_t itmask = 0;
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_ADC_IT(ADC_IT)); 
  /* Get the ADC IT index */
  itmask = (uint8_t)(ADC_IT >> 8);
  /* Clear the selected ADC interrupt pending bits */
  ADCx->SR = ~(uint32_t)itmask;
}                    
/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */ 

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/


